import * as yup from "yup";

export const loginFormSchema = yup.object({
  login: yup
    .string()
    .required("Обязательное поле")
    .min(4, "Слишком короткий логин")
    .max(16, "Слишком длинный логин")
    .matches(
      /(?!-)(?!.*__)(?!.*-_)(?!.*_-)(?!.*--)^[_a-zA-Z0-9-]+$/,
      "Неккоректный логин"
    ),
  password: yup
    .string()
    .required("Обязательное поле")
    .min(8, "Слишком короткий пароль")
    .max(32, "Слишком длинный пароль")
    .matches(/^[~`!@#$%^&*()_+=[\]\{}|;':",.\/<>?a-zA-Z0-9-]+$/, "Пароль слишком простой")
    .matches(/(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[^A-Za-z0-9])(?=.{8,})/, "Пароль слишком простой"),
});
